# Brewfile

# Taps
tap "rbenv/tap"
tap "nikitabobko/tap"
tap "FelixKratz/formulae"
tap "daipeihust/tap"
tap "hashicorp/tap"
tap "k1low/tap"
tap "hytfjwr/tap"

# CLI
brew "git"
brew "gh"
brew "neovim"
brew "mise"
brew "uv"
brew "tree"
brew "pv"
brew "ripgrep"
brew "fzf"
brew "ghq"
brew "pinact"
brew "shellcheck"
brew "gzip"
brew "wget"
brew "awscli"
brew "zsh-completions"
brew "docker"
brew "fd"
brew "bat"
brew "stylua"
brew "jq"
brew "zoxide"
brew "daipeihust/tap/im-select"
brew "lazygit"
brew "watch"
brew "FelixKratz/formulae/borders"
brew "yazi"
brew "ffmpeg-full"
brew "sevenzip"
brew "poppler"
brew "resvg"
brew "imagemagick-full"
brew "hashicorp/tap/terraform"
brew "hashicorp/tap/terraform-ls"
brew "k1low/tap/mo"
brew "fswatch"
brew "lefthook"

# Dependencies for mise builds
brew "rbenv/tap/openssl@1.1"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "gd"
brew "gettext"
brew "icu4c"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libjpeg"
brew "libpng"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "pkg-config"
brew "re2c"
brew "readline"
brew "zlib"
brew "oniguruma"

# Apps
cask "wezterm@nightly"
cask "ghostty"
cask "cmux"
cask "neovide-app"
cask "visual-studio-code"
cask "cursor"
cask "gcloud-cli"
cask "tableplus"
cask "sequel-ace"
cask "azookey"
cask "raycast"
cask "arc"
cask "keyboardcleantool"
cask "chatgpt"
cask "orbstack"
cask "google-chrome"
cask "gitify"
cask "spotify"
cask "phpstorm"
cask "karabiner-elements"
cask "clipy"
cask "nikitabobko/tap/aerospace"
cask "alt-tab"
cask "betterdisplay"
cask "hytfjwr/tap/statusbar"
cask "font-hack-nerd-font"
cask "font-maple-mono"
cask "font-symbols-only-nerd-font"