# Brewfile

# CLI
brew "git"
brew "gh"
brew "neovim"
brew "php"
brew "node"
brew "pnpm"
brew "bun"
brew "uv"
brew "tree"
brew "pv"
brew "ripgrep"
brew "fzf"
brew "ghq"
brew "pinact"
brew "pyenv"
brew "shellcheck"
brew "gzip"
brew "wget"
brew "zsh-completions"
brew "docker"

# Apps
cask "warp"
cask "neovide"
cask "visual-studio-code"
cask "cursor"
cask "google-cloud-sdk"
cask "tableplus"
cask "sequel-ace"
cask "google-japanese-ime"
cask "raycast"
cask "runcat"
cask "arc"
cask "keyboardcleantool"
cask "chatgpt"
cask "orbstack"
cask "google-chrome"
cask "gitify"
cask "spotify"
cask "amazon-prime-video"
cask "phpstorm"
cask "karabiner-elements"
cask "clipy"