# Brewfile

# Taps
tap "rbenv/tap"

# CLI
brew "git"
brew "gh"
brew "neovim"
brew "mise"
brew "pnpm"
brew "uv"
brew "tree"
brew "pv"
brew "ripgrep"
brew "fzf"
brew "ghq"
brew "pinact"
brew "shellcheck"
brew "gzip"
brew "wget"
brew "zsh-completions"
brew "docker"
brew "fd"
brew "stylua"

# Dependencies for mise builds
brew "rbenv/tap/openssl@1.1"
brew "openssl@3"
brew "autoconf"
brew "automake"
brew "bison"
brew "freetype"
brew "gd"
brew "gettext"
brew "icu4c"
brew "krb5"
brew "libedit"
brew "libiconv"
brew "libjpeg"
brew "libpng"
brew "libsodium"
brew "libxml2"
brew "libyaml"
brew "libzip"
brew "pkg-config"
brew "re2c"
brew "readline"
brew "zlib"
brew "oniguruma"

# Apps
cask "wezterm@nightly"
cask "neovide-app"
cask "visual-studio-code"
cask "cursor"
cask "gcloud-cli"
cask "tableplus"
cask "sequel-ace"
cask "google-japanese-ime"
cask "raycast"
cask "arc"
cask "keyboardcleantool"
cask "chatgpt"
cask "orbstack"
cask "google-chrome"
cask "gitify"
cask "spotify"
cask "phpstorm"
cask "karabiner-elements"
cask "clipy"